app/views/submissions/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."submission_id" = $1  [["submission_id", 2]]
---
        <tr class="post">
          <td> <p><%= submission.get_upvotes.size %> likes, by <%= submission.user.email %> <%= time_ago_in_words(submission.created_at) %> ago | <%= link_to "#{submission.comments.count} comments", submission %> </p></td>