app/views/submissions/show.html.erb

  </h4>
  <p><%= @submission.get_upvotes.size %> points by <%= @submission.user.email %> <%= time_ago_in_words(@submission.created_at) %> ago | <%= link_to "#{@submission.comments.count} comments", @submission %> </p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."submission_id" = $1  [["submission_id", 2]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."submission_id" = $1  [["submission_id", 2]]