app/controllers/comments_controller.rb

  def create
    @submission = Submission.find(params[:submission_id])
    @comment = @submission.comments.new(comment_params)
    @comment.user = current_user

    respond_to do |format|
      if @comment.save
---
SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("submission_id", "body", "user_id", "created_at", "updated_at", "title") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["submission_id", 8], ["body", "cuerpo comentario"], ["user_id", 4], ["created_at", "2018-03-16 16:19:42.803760"], ["updated_at", "2018-03-16 16:19:42.803760"], ["title", "titulo comentario"]]