app/controllers/submissions_controller.rb

  def index
    @submissions = Submission.all
---
SELECT "submissions".* FROM "submissions" ORDER BY "submissions"."created_at" DESC

  def create
    @submission = current_user.submissions.build(submission_params)

    respond_to do |format|
      if @submission.save
---
INSERT INTO "submissions" ("title", "lead", "body", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "titulo"], ["lead", "bajadax"], ["body", "cuerpoz"], ["created_at", "2018-03-15 23:02:36.444062"], ["updated_at", "2018-03-15 23:02:36.444062"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @submission.update(submission_params)
---
UPDATE "submissions" SET "body" = $1, "updated_at" = $2 WHERE "submissions"."id" = $3  [["body", "asdasasx\r\nas\r\nxasx\r\nsacascºº111"], ["updated_at", "2018-03-16 22:21:34.016690"], ["id", 16]]

  def destroy
    @submission.destroy
---
DELETE FROM "submissions" WHERE "submissions"."id" = $1  [["id", 1]]

    def set_submission
      @submission = Submission.find(params[:id])
---
SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]