app/controllers/submissions_controller.rb

  def list
    @submissions = Submission.order(created_at: :desc)
---
SELECT "submissions".* FROM "submissions" ORDER BY "submissions"."created_at" DESC